Autodesk.Revit.DB.DirectContext3D.VertexFormat.IsValid
Tests whether the vertex format specification is valid for rendering.
Remarks:
The vertex format specifications are internally associated with low-level graphics state and may become invalidated when
the state changes. Therefore, an application should test each vertex format object for validity before using it when
submitting geometry. If the vertex format object becomes invalid, the application should re-create it.
Returns:
True if the vertex format specification is valid for rendering, false otherwise.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexFormat.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DirectContext3D.VertexFormat.#ctor(Autodesk.Revit.DB.DirectContext3D.VertexFormatBits)
Constructs the specification of vertex format from a numerical representation.
vertexFormatBits:
The numerical representation of the vertex format.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This VertexFormat is not available because Revit is not currently rendering. In general, this VertexFormat must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexFormat
A specification of the format of vertex data contained in a piece of geometry.
Since:
2017